УТ_для_edt/src/Catalogs/CRM_Решения/CRM_Решения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_Решения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <comment>Автор решения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВложений</name>
    <comment>Источник вложений</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКатегория</name>
    <comment>Основная категория</comment>
    <type>
      <types>CatalogRef.CRM_КатегорииРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <comment>Проект/процесс</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРешения</name>
    <comment>Статус решения</comment>
    <type>
      <types>EnumRef.CRM_СтатусыРешений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <comment>Текст вопроса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопросаHTML</name>
    <comment>Текст вопроса в формате HTML</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименованияРешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Категории</name>
    <comment>Категории</comment>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_КатегорииРешений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответы</name>
    <comment>Ответы</comment>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АвторИзменения</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтвета</name>
      <comment>Вариант ответа</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаHTML</name>
      <comment>Вариант ответа в формате HTML</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОтвета</name>
      <comment>Наименование ответа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОтвета</name>
      <comment>Статус ответа</comment>
      <type>
        <types>EnumRef.CRM_СтатусыРешений</types>
      </type>
    </attributes>
    <attributes>
      <name>удалитьCRM_НомерСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_СвязанныеРешения/CRM_СвязанныеРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_СвязанныеРешения</name>
  <dimensions>
    <name>Решение</name>
    <comment>Решение</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанноеРешение</name>
    <comment>Связанное решение</comment>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_СтатусыРешений/CRM_СтатусыРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыРешений</name>
  <enumValues>
    <name>Личное</name>
    <comment>Личное</comment>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
    <comment>На рассмотрении</comment>
  </enumValues>
  <enumValues>
    <name>Утверждено</name>
    <comment>Утверждено</comment>
  </enumValues>
  <enumValues>
    <name>Устарело</name>
    <comment>Устарело</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_КатегорииРешений/CRM_КатегорииРешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_КатегорииРешений</name>
  <comment>Категории решений базы знаний</comment>
  <predefined>
    <items>
      <name>ТекущиеПроблемы</name>
      <description>Выявленные текущие проблемы</description>
    </items>
    <items>
      <name>ДополнительнаяИнформация</name>
      <description>Дополнительная информация</description>
    </items>
    <items>
      <name>РекомендуемаяИнформация</name>
      <description>Рекомендуемая информация</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКрасный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗеленый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветСиний</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>101</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_РешенияПрисоединенныеФайлы/CRM_РешенияПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_РешенияПрисоединенныеФайлы</name>
  <comment>Присоединенные файлы (Решения базы знаний)</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.CRM_Решения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <comment>Статус извлечения текста - для фонового задания извлечения текста</comment>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьCRM_ИдентификаторПочтовогоВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДФайлаЭлектронногоПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>удалитьCRM_НомерСтроки</name>
    <comment>Номер строки табличной части</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <comment>Отпечаток сертификата</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_Решения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.СтатусРешения	= ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении");
		Объект.Автор			= ТекущийПользователь();
	КонецЕсли;
	
	Элементы.ПрисоединенныеФайлы.Заголовок = "Файлы (" + ПолучитьЧислоВложений() + ")";
	
	// Устанавливаем доступность решения.
	УстановитьДоступностьРешения();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	ВидимостьСостоянияОтветов();
	
	ЗаполнитьСвязанныеРешения();
	СформироватьПредставлениеСвязанныхРешений();
	
	ОтрисоватьКатегорииНаФорме();
	
	// Устанавливаем доступность ответов.
	УстановитьДоступностьОтветов();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаВыбора".
//
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.CRM_Решения") Тогда
		ДобавитьСвязанноеРешение(ВыбранноеЗначение);
		СформироватьПредставлениеСвязанныхРешений();
	КонецЕсли;
КонецПроцедуры // ОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события формы "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если (ИмяСобытия = "ПроверкаПравописания_ИзмененТекст") И (Источник = ЭтаФорма) Тогда
		Если Параметр.ИмяРеквизита = "ТекстВопросаHTML" Тогда
			ОбновитьТекстВопросаHTML(Параметр.Текст, Параметр.Вложения);
		ИначеЕсли Параметр.ИмяРеквизита = "ВариантОтветаHTML" Тогда
			ОбновитьВариантОтветаHTML(Параметр.Текст, Параметр.Вложения);
			ВариантОтветаHTMLПриИзменении(Элементы.ВариантОтветаHTML);
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		Если ФормаОткрытаИзОтветов Тогда
			Если (ТипЗнч(Источник) = Тип("СправочникСсылка.CRM_РешенияПрисоединенныеФайлы")
				Или ТипЗнч(Источник) = Тип("Массив") И Источник.Количество()>0 И ТипЗнч(Источник[0]) = Тип("СправочникСсылка.CRM_РешенияПрисоединенныеФайлы")) Тогда
				ОбработатьЗаписьПрисоединенныхФайловОтвета(Источник);
				
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
				ПараметрыФормы.Вставить("ТолькоПросмотр", Не ОтветДоступен);
				ПараметрыФормы.Вставить("CRM_НеЗапрашиватьКонтекст", Истина);
				
				ФормаПрисоединенныхФайлов = ПолучитьФорму("Обработка.РаботаСФайлами.Форма.CRM_ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
				
				Если ФормаПрисоединенныхФайлов.Открыта() Тогда
					ФормаПрисоединенныхФайлов.Элементы.Список.Обновить();
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ФормаОткрытаИзОтветов Тогда
			УправлениеОтметкойНаличияФайловОтветы(ТекущийИДОтветаОтбор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДокументHTMLТекущегоПисьмаПодготовлен = Ложь;
	ТаблицаСоответствийИменВложенийИдентификаторам.Очистить();
	
	СтруктураВложений = Новый Структура;
	ТекстВопросаHTML.ПолучитьHTML(ТекущийОбъект.ТекстВопросаHTML, СтруктураВложений);
	
	ДобавитьВТаблицуСоответствийИменВложенийИдентификаторамКартинкиИзИнтернета(ТекущийОбъект.ТекстВопросаHTML);
	
	Для каждого Вложение Из СтруктураВложений Цикл
		
		НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
		НоваяСтрока.ИмяФайла = Вложение.Ключ;
		НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
		НоваяСтрока.Картинка = Вложение.Значение;
		
	КонецЦикла;
	
	Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
		
		ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекущийОбъект.ТекстВопросаHTML);
		Взаимодействия.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(
		ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторам.Выгрузить());
		ДокументHTMLТекущегоПисьмаПодготовлен = Истина;
		
	КонецЕсли;
	
	Если ДокументHTMLТекущегоПисьмаПодготовлен Тогда
		ТекущийОбъект.ТекстВопросаHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
	КонецЕсли;
	
	ТекущийОбъект.ТекстВопроса = Взаимодействия.ПолучитьОбычныйТекстИзHTML(ТекущийОбъект.ТекстВопросаHTML);
	
	Для Каждого СтрокаОтвета Из ТаблицаСоответствийОтветов Цикл
		
		ДокументHTMLТекущегоОтветаПодготовлен = Ложь;
		ТаблицаСоответствийИменВложенийИдентификаторамОтветы.Очистить();
		
		ДобавитьВТаблицуСоответствийИменВложенийИдентификаторамКартинкиИзИнтернета(СтрокаОтвета.ВариантОтветаHTML);
		
		Для каждого Вложение Из СтрокаОтвета.СтруктураВложений Цикл
			
			НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторамОтветы.Добавить();
			НоваяСтрока.ИмяФайла = Вложение.Ключ;
			НоваяСтрока.ИдентификаторФайлаДляHTML = Строка(Новый УникальныйИдентификатор)+"_"+СтрокаОтвета.ИДСтроки;
			НоваяСтрока.Картинка = Вложение.Значение;
			
		КонецЦикла;
		
		ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(СтрокаОтвета.ВариантОтветаHTML);
		Взаимодействия.ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(
		ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторамОтветы.Выгрузить());
		ДокументHTMLТекущегоОтветаПодготовлен = Истина;
		
		МассивОтветов = ТекущийОбъект.Ответы.НайтиСтроки(Новый Структура("ИДСтроки",СтрокаОтвета.ИДСтроки));
		
		МассивОтветов[0].ВариантОтветаHTML = Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		МассивОтветов[0].ВариантОтвета     = Взаимодействия.ПолучитьОбычныйТекстИзHTML(МассивОтветов[0].ВариантОтветаHTML);
		
		Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторамОтветы Цикл
			НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Вложение);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Добавим в список удаленных вложений ранее сохраненные картинки, отображаемые в теле форматированного документа.
	ТаблицаВложенийКартинокФорматированногоДокумента = Взаимодействия.ПолучитьВложенияПисьмаСНеПустымИД(ТекущийОбъект.Ссылка);
	Для каждого Вложение Из ТаблицаВложенийКартинокФорматированногоДокумента Цикл
		
		МассивОтветов = Объект.Ответы.НайтиСтроки(Новый Структура("ИДСтроки",Вложение.ИДФайлаЭлектронногоПисьма));
		Если МассивОтветов.Количество() = 0 Тогда
			УдаленныеВложения.Добавить(Вложение.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим удаленные вложения
	Для Каждого УдаленноеВложение Из УдаленныеВложения Цикл
		ОбъектВложение = УдаленноеВложение.Значение.ПолучитьОбъект();
		ОбъектВложение.Удалить();
	КонецЦикла;
	
	УдаленныеВложения.Очистить();
	
	Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторам Цикл
		
		ИмяФайлаВложения = "_" + СтрЗаменить(Вложение.ИдентификаторФайлаДляHTML, "-", "_") + "." + ?(Вложение.Картинка.Формат() = ФорматКартинки.НеизвестныйФормат, "PNG", Вложение.Картинка.Формат());
		
		ДвоичныеДанныеКартинки = Вложение.Картинка.ПолучитьДвоичныеДанные();
		АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
		ПрисоединенныйФайл = CRM_УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
		ТекущийОбъект.Ссылка,
		АдресКартинкиВоВременномХранилище,
		ИмяФайлаВложения,
		ДвоичныеДанныеКартинки.Размер());
		
		Если ПрисоединенныйФайл <> Неопределено Тогда
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.ИдентификаторФайлаДляHTML;
			ПрисоединенныйФайлОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события формы "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаписатьСвязанныеРешения();
	УстановитьДоступностьОтветов();
	Оповестить("CRM_РешенияОбновлениеСправочника", Объект.Ссылка);
	УжеЗаписан = Ложь;
	
КонецПроцедуры // ПослеЗаписи()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Проект".
//
Процедура ПроектПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Проект) И Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.Подразделение = ПолучитьЗначениеРеквизита(Объект.Проект, "CRM_Подразделение");
	КонецЕсли;	
КонецПроцедуры // ПроектПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "СтатусРешения".
//
Процедура СтатусРешенияПриИзменении(Элемент)
	ВидимостьСостоянияОтветов();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" элемента формы "СтатусРешения".
//
Процедура СтатусРешенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	Если Объект.Автор = ТекущийПользователь() Тогда	
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Личное"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении"));
	КонецЕсли;	
	Если CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		Если СписокВыбора.НайтиПоЗначению(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении")) = Неопределено Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении"));
		КонецЕсли;	
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Утверждено"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Устарело"));
	КонецЕсли;
	Если СписокВыбора.Количество() = 0 Тогда Возврат; КонецЕсли;
	НачальноеЗначение = СписокВыбора.НайтиПоЗначению(Объект.СтатусРешения);
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатусРешенияНачалоВыбораЗавершение", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент, НачальноеЗначение);
КонецПроцедуры // СтатусРешенияНачалоВыбора()

&НаКлиенте
Процедура СтатусРешенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если Не (ВыбранныйЭлемент = Неопределено) Тогда
		Объект.СтатусРешения = ВыбранныйЭлемент.Значение;
		СтатусРешенияПриИзменении(Неопределено);
	КонецЕсли;	
КонецПроцедуры // СтатусРешенияНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "Нажатия" элемента формы "ПредставлениеСвязанныхРешений".
//
Процедура ПредставлениеСвязанныхРешенийНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка				= Ложь;
	СформироватьПредставлениеСвязанныхРешений();
КонецПроцедуры // ПредставлениеСвязанныхРешенийНажатие()

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" таблицы формы "Ответы".
//
Процедура ОтветыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОтветыПриАктивизацииСтроки", 0.2, Истина);
	
КонецПроцедуры // ОтветыПриАктивизацииСтроки()

&НаКлиенте
// Процедура - обработчик события "ПередОкончаниемРедактирования" таблицы формы "Ответы".
//
Процедура ОтветыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТД.АвторИзменения	= ТекущийПользователь();
		ТД.СтатусОтвета		= ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении");
		// Устанавливаем доступность ответа.
		УстановитьДоступностьОтвета();
	КонецЕсли;
	
КонецПроцедуры // ОтветыПередОкончаниемРедактирования()

&НаКлиенте
// Процедура - обработчик события "ПередУдалением" таблицы формы "Ответы".
//
Процедура ОтветыПередУдалением(Элемент, Отказ)
	
	ТД = Элементы.Ответы.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Отказ = Истина;
	ИначеЕсли Не CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		Если ЗначениеЗаполнено(ТД.АвторИзменения) И Не (ТД.АвторИзменения = ТекущийПользователь()) Тогда
			Отказ = Истина;
		КонецЕсли;	
	ИначеЕсли Объект.Ответы.Количество() = 1 Тогда
		ТекущийИДОтвета = "";
	КонецЕсли;
	
	Если Не Отказ Тогда
		МассивСтрок = ТаблицаСоответствийОтветов.НайтиСтроки(Новый Структура("ИДСтроки",ТД.ИДСтроки));
		ТаблицаСоответствийОтветов.Удалить(ТаблицаСоответствийОтветов.Индекс(МассивСтрок[0]));
	КонецЕсли;
	
КонецПроцедуры // ОтветыПередУдалением()

// Процедура - обработчик события "ПриНачалеРедактирования" таблицы формы "Ответы".
//
&НаКлиенте
Процедура ОтветыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ИДСтроки = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_");
		СтрокаСоответствия = ТаблицаСоответствийОтветов.Добавить();
		
		ТекущийИДОтвета = Элемент.ТекущиеДанные.ИДСтроки;
		СтрокаСоответствия.ИДСтроки = ТекущийИДОтвета;
		СтрокаСоответствия.ВариантОтветаHTML = "";
		СтрокаСоответствия.СтруктураВложений = Новый Структура;
	КонецЕсли;
	
КонецПроцедуры  // ОтветыПриНачалеРедактирования()

// Процедура - обработчик события "ПослеУдаления" таблицы формы "Ответы".
//
&НаКлиенте
Процедура ОтветыПослеУдаления(Элемент)
	ТД = Элементы.Ответы.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		ВариантОтветаHTML.Удалить();
		Возврат;
	КонецЕсли;
	
	ТекущийИДОтвета = ТД.ИДСтроки;
	// Устанавливаем доступность ответа.
	УстановитьДоступностьОтвета();
	
КонецПроцедуры  // ОтветыПослеУдаления()

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" поля ввода "СтатусОтвета" таблицы формы "Ответы".
//
Процедура ОтветыСтатусОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.Ответы.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	Если CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		СтандартнаяОбработка = Ложь;
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.НаРассмотрении"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Утверждено"));
		СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Устарело"));
		НачальноеЗначение = СписокВыбора.НайтиПоЗначению(ТД.СтатусОтвета);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветыСтатусОтветаНачалоВыбораЗавершение", ЭтотОбъект, ТД);
		ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент, НачальноеЗначение);
	КонецЕсли;	
КонецПроцедуры // ОтветыСтатусОтветаНачалоВыбора()

&НаКлиенте
Процедура ОтветыСтатусОтветаНачалоВыбораЗавершение(ВыбранныйЭлемент, ТД) Экспорт
	Если Не (ВыбранныйЭлемент = Неопределено) Тогда
		ТД.СтатусОтвета = ВыбранныйЭлемент.Значение;
	КонецЕсли;	
КонецПроцедуры // ОтветыСтатусОтветаНачалоВыбора()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "ВариантОтветаHTML".
//
Процедура ВариантОтветаHTMLПриИзменении(Элемент)
	
	ТД = Элементы.Ответы.ТекущиеДанные;
	
	Если ТД = Неопределено Тогда
		Если ПустаяСтрока(ВариантОтветаHTML.ПолучитьТекст()) Тогда Возврат; КонецЕсли;
		
		НовыйОтвет = Объект.Ответы.Добавить();
		НовыйОтвет.ИДСтроки = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_");
		
		ТекущийИДОтвета = НовыйОтвет.ИДСтроки;
	КонецЕсли;
	
	МассивСтрок = ТаблицаСоответствийОтветов.НайтиСтроки(Новый Структура("ИДСтроки",ТекущийИДОтвета));
	Если МассивСтрок.Количество() = 0 Тогда
		СтрокаСоответствия = ТаблицаСоответствийОтветов.Добавить();
		СтрокаСоответствия.ИДСтроки = ТекущийИДОтвета;
	Иначе
		СтрокаСоответствия = МассивСтрок[0];
	КонецЕсли;
	СтруктураВложений = Новый Структура;
	ВариантОтветаHTML.ПолучитьHTML(СтрокаСоответствия.ВариантОтветаHTML, СтруктураВложений);
	СтрокаСоответствия.СтруктураВложений = СтруктураВложений;
	
КонецПроцедуры // ВариантОтветаHTMLПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" таблицы формы "СвязанныеРешения".
//
Процедура СвязанныеРешенияПриИзменении(Элемент)
	СформироватьПредставлениеСвязанныхРешений();
КонецПроцедуры // СвязанныеРешенияПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" таблицы формы "СвязанныеРешения".
//
Процедура СвязанныеРешенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",			Истина);
	ФормаВыбора = ПолучитьФорму("Справочник.CRM_Решения.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	СписокРешений = ПолучитьСписокСвязаныхРешений();
	НовыйОтбор = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка");
	НовыйОтбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	НовыйОтбор.ПравоеЗначение	= СписокРешений;
	ФормаВыбора.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СвязанныеРешенияПередНачаломДобавленияЗавершение", ЭтотОбъект);
	ФормаВыбора.Открыть();
КонецПроцедуры // СвязанныеРешенияПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" таблицы формы "СвязанныеРешения".
//
Процедура СвязанныеРешенияПередНачаломДобавленияЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если Не (ВыбранныйЭлемент = Неопределено) Тогда
	КонецЕсли;
КонецПроцедуры // СвязанныеРешенияПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломИзменения" таблицы формы "СвязанныеРешения".
//
Процедура СвязанныеРешенияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ", ТД.Решение);
	ФормаРешения = ПолучитьФорму("Справочник.CRM_Решения.ФормаОбъекта", ПараметрыФормы, Элемент);
	ФормаРешения.Открыть();	
КонецПроцедуры // СвязанныеРешенияПередНачаломИзменения()

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияВыбратьКатегории".
//
Процедура ДекорацияВыбратьКатегорииНажатие(Элемент)
	МассивКатегорий = Новый Массив();
	Для Каждого КатегорияСтрока Из Объект.Категории Цикл
		МассивКатегорий.Добавить(КатегорияСтрока.Категория);
	КонецЦикла;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивКатегорий",		МассивКатегорий);
	ПараметрыФормы.Вставить("ОсновнаяКатегория",	Объект.ОсновнаяКатегория);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияВыбратьКатегорииНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.CRM_Решения.Форма.ВыборКатегорий", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие" элемента формы "ДекорацияВыбратьКатегории".
//
Процедура ДекорацияВыбратьКатегорииНажатиеЗавершение(СписокВыбранныеКатегории, ДополнительныеПараметры) Экспорт
	Если СписокВыбранныеКатегории = Неопределено Тогда Возврат; КонецЕсли;
	Модифицированность = Истина;
	Объект.Категории.Очистить();
	Объект.ОсновнаяКатегория = ПредопределенноеЗначение("Справочник.CRM_КатегорииРешений.ПустаяСсылка");
	Для Каждого СтрокаКатегория Из СписокВыбранныеКатегории Цикл
		НоваяСтрока				= Объект.Категории.Добавить();
		НоваяСтрока.Категория	= СтрокаКатегория.Значение;
		Если СтрокаКатегория.Пометка Тогда
			Объект.ОсновнаяКатегория = НоваяСтрока.Категория;
		КонецЕсли;
	КонецЦикла;
	ОтрисоватьКатегорииНаФорме();
КонецПроцедуры

&НаКлиенте
// Процедура - динамически подключаемыйт обработчик события "НачалоВыбора" элементов формы отображения категорий.
//
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // Подключаемый_ПолеВводаИгнорироватьОбработчикНачалоВыбора()

&НаКлиенте
// Процедура - динамически подключаемыйт обработчик события "Очистка" элементов формы отображения категорий.
//
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // Подключаемый_ПолеВводаИгнорироватьОбработчикОчистка()

&НаКлиенте
// Процедура - динамически подключаемыйт обработчик события "Открытие" элементов формы отображения категорий.
//
Процедура Подключаемый_ПолеВводаИгнорироватьОбработчикОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры // Подключаемый_ПолеВводаИгнорироватьОбработчикОткрытие()

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ КОМАНД ФОРМЫ

&НаКлиентеНаСервереБезКонтекста
Функция НайтиПолеВОтборе(ЭлементыОтбора, Поле)
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			НайденныйЭлемент = НайтиПолеВОтборе(ЭлементОтбора.Элементы, Поле);
			Если НайденныйЭлемент <> Неопределено Тогда
				Возврат НайденныйЭлемент;
			КонецЕсли;
		Иначе
			Если ЭлементОтбора.ЛевоеЗначение = Поле Тогда
				Возврат ЭлементОтбора;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОтветыПрисоединенныеФайлы(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Текст = НСтр("ru='Данные еще не записаны."
		"Переход к ""Файлы ответа"" возможен только после записи данных."
		"Данные будут записаны.'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветыПрисоединенныеФайлыЗавершение", ЭтотОбъект, Ложь);
		ПоказатьВопрос(ОписаниеОповещения, Текст,РежимДиалогаВопрос.ДаНет,,,,);
	Иначе
		ОтветыПрисоединенныеФайлыЗавершение(Неопределено, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветыПрисоединенныеФайлыЗавершение(Ответ, Записано) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Записано = Записать();
	КонецЕсли;
	
	Если Записано = Истина Тогда
		Если ВариантОтветаИзменен Тогда
			Текст = НСтр("ru='Данные изменены."
			"Переход к ""Файлы ответа"" возможен только после записи данных."
			"Данные будут записаны.'");
			ОповещениеНовое = Новый ОписаниеОповещения("ПослеВопросаОСохраненииВариантаОтвета", ЭтотОбъект);
			ПоказатьВопрос(ОповещениеНовое,Текст,РежимДиалогаВопрос.ДаНет,,,,);
			Возврат;
		КонецЕсли;	
		
		ТД = Элементы.Ответы.ТекущиеДанные;
		Если ТД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ФормаОткрытаИзОтветов = Истина;
		ТекущийИДОтветаОтбор = ТекущийИДОтвета;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Не ОтветДоступен);
		ПараметрыФормы.Вставить("CRM_НеЗапрашиватьКонтекст", Истина);
		
		ФормаПрисоединенныхФайлов = ПолучитьФорму("Обработка.РаботаСФайлами.Форма.CRM_ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
		
		Если ФормаПрисоединенныхФайлов.Открыта() Тогда
			ПолеОтбораЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ИДФайлаЭлектронногоПисьма");
			ЭлементОтбора = НайтиПолеВОтборе(ФормаПрисоединенныхФайлов.Список.Отбор.Элементы, ПолеОтбораЛевоеЗначение);
			Если ЭлементОтбора = Неопределено Тогда
				ЭлементОтбора = ФормаПрисоединенныхФайлов.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение	= ПолеОтбораЛевоеЗначение;
				ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение= ТекущийИДОтвета;
			Иначе
				ЭлементОтбора.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = ТекущийИДОтвета;
			КонецЕсли;
			
			ФормаПрисоединенныхФайлов.Активизировать();
		Иначе
			ФормаПрисоединенныхФайлов.ЗакрыватьПриЗакрытииВладельца = Истина;
			
			ЭлементОтбора = ФормаПрисоединенныхФайлов.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка.ИДФайлаЭлектронногоПисьма");
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = ТекущийИДОтвета;
			
			ФормаПрисоединенныхФайлов.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСохраненииВариантаОтвета(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать();
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик команды формы "ПроверкаПравописанияВопроса".
//
Процедура ПроверкаПравописанияВопроса(Команда)
	Если ПустаяСтрока(ТекстВопросаHTML.ПолучитьТекст()) Тогда Возврат; КонецЕсли;
	ВариантВопроса	= "";
	ВложенияВопроса	= Новый Структура;
	ТекстВопросаHTML.ПолучитьHTML(ВариантВопроса, ВложенияВопроса);
	CRM_ОбщегоНазначенияКлиент.ПроверитьПравописаниеТекста(ВариантВопроса, ВложенияВопроса,  "ТекстВопросаHTML", ЭтотОбъект);
КонецПроцедуры // ПроверкаПравописанияВопроса()

&НаКлиенте
// Процедура - обработчик команды формы "ПроверкаПравописанияОтвета".
//
Процедура ПроверкаПравописанияОтвета(Команда)
	Если ПустаяСтрока(ВариантОтветаHTML.ПолучитьТекст()) Тогда Возврат; КонецЕсли;
	ВариантОтвета	= "";
	ВложенияОтвета	= Новый Структура;
	ВариантОтветаHTML.ПолучитьHTML(ВариантОтвета, ВложенияОтвета);
	CRM_ОбщегоНазначенияКлиент.ПроверитьПравописаниеТекста(ВариантОтвета, ВложенияОтвета,  "ВариантОтветаHTML", ЭтотОбъект);
	ВариантОтветаИзменен = Истина;
КонецПроцедуры // ПроверкаПравописанияОтвета()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьЗаписьПрисоединенныхФайловОтвета(МассивФайлов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ПрисоединенныйФайл Из МассивФайлов Цикл
		Если ПрисоединенныйФайл.ВладелецФайла = Объект.Ссылка Тогда
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = ТекущийИДОтветаОтбор;
			ПрисоединенныйФайлОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура обновляет значение поля "ТекстВопросаHTML".
//
Процедура ОбновитьТекстВопросаHTML(Текст, Вложения)
	
	ТекстВопросаHTML.УстановитьHTML(Текст, Вложения);
	
КонецПроцедуры

&НаСервере
// Процедура обновляет значение поля "ВариантОтветаHTML".
//
Процедура ОбновитьВариантОтветаHTML(Текст, Вложения)
	
	ВариантОтветаHTML.УстановитьHTML(Текст, Вложения);
	
КонецПроцедуры // ОбновитьВариантОтветаHTML()

&НаСервереБезКонтекста
// Функция возвращает текущего пользователя.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	СправочникСсылка	- Текущий пользователь.
//
Функция ТекущийПользователь()
	Возврат Пользователи.ТекущийПользователь();
КонецФункции // ТекущийПользователь()

&НаСервереБезКонтекста
// Функция возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
// Параметры:
//  СсылкаНаОбъект	- Ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита	- Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ПолучитьЗначениеРеквизита(СсылкаНаОбъект, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, ИмяРеквизита);
КонецФункции // ПолучитьЗначениеРеквизита()

&НаСервере
// Процедура заполняет заголовок кнопки "Присоединенные файлы у ТЧ Ответы".
//
// Параметры:
//	Нет.
//
Процедура УправлениеОтметкойНаличияФайловОтветы(ПереданныйИДОтветаОтбор)
	НаличиеФайлов = 0;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		табВложения = ПолучитьВложения(Объект.Ссылка, ПереданныйИДОтветаОтбор);
		
		НаличиеФайлов = табВложения.Количество();
	КонецЕсли;
	Если НаличиеФайлов = 0 Тогда
		Элементы.ОтветыПрисоединенныеФайлы.Отображение = ОтображениеКнопки.Картинка;
	Иначе
		Элементы.ОтветыПрисоединенныеФайлы.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Текст = Формат(НаличиеФайлов, "ЧГ=");
		Если НаличиеФайлов <= 1 Тогда
			Текст = Текст + " файл";
		ИначеЕсли НаличиеФайлов <= 4 Тогда
			Текст = Текст + " файла";
		Иначе
			Текст = Текст + " файлов";
		КонецЕсли;
		Элементы.ОтветыПрисоединенныеФайлы.Заголовок = Текст;
	КонецЕсли;
КонецПроцедуры // УправлениеОтметкойНаличияФайловОтветы()

&НаСервере
// Процедура заполняет таблицу связанных решений.
//
// Параметры:
//	Нет.
//
Процедура ЗаполнитьСвязанныеРешения()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Решение", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_СвязанныеРешения.СвязанноеРешение КАК Решение,
	|	CRM_СвязанныеРешения.СвязанноеРешение.СтатусРешения КАК Состояние,
	|	CRM_СвязанныеРешения.СвязанноеРешение.ПредставлениеНаименованияРешения КАК Наименование
	|ИЗ
	|	РегистрСведений.CRM_СвязанныеРешения КАК CRM_СвязанныеРешения
	|ГДЕ
	|	CRM_СвязанныеРешения.Решение = &Решение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Решение";
	СвязанныеРешения.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры // ЗаполнитьСвязанныеРешения()	

&НаСервере
// Процедура записывает в регистр таблицу связанных решений.
//
// Параметры:
//	Нет.
//
Процедура ЗаписатьСвязанныеРешения()
	НаборЗаписей = РегистрыСведений.CRM_СвязанныеРешения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Решение.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Для Каждого СвязанноеРешение Из СвязанныеРешения Цикл
		НоваяЗапись						= НаборЗаписей.Добавить();
		НоваяЗапись.Решение				= Объект.Ссылка;
		НоваяЗапись.СвязанноеРешение	= СвязанноеРешение.Решение;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение;
	КонецПопытки;	
КонецПроцедуры // ЗаписатьСвязанныеРешения()

&НаСервере
// Функция возвращает список решений, которые не должны отображаться в форме выбора решений.
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	СписокЗначений	- Список решений.
//
Функция ПолучитьСписокСвязаныхРешений()
	СписокРешений = Новый СписокЗначений;
	СписокРешений.ЗагрузитьЗначения(СвязанныеРешения.Выгрузить(,"Решение").ВыгрузитьКолонку("Решение"));
	СписокРешений.Добавить(Объект.Ссылка);
	Возврат СписокРешений;
КонецФункции // ПолучитьСписокСвязанныхРешений()	

&НаСервере
// Процедура заполняет значение поля "ВариантОтветаHTML".
//
// Параметры:
//	НомерСтроки	- Число	- Номер строки ТЧ "Ответы".
//
Процедура ЗаполнитьВариантОтветаHTML()
	
	МассивСтрок = ТаблицаСоответствийОтветов.НайтиСтроки(Новый Структура("ИДСтроки",ТекущийИДОтвета));
	Если МассивСтрок.Количество() = 0 Тогда
		ВариантОтветаHTML.УстановитьHTML("<html></html>", Новый Структура);
	Иначе	
		ВариантОтветаHTML.УстановитьHTML(МассивСтрок[0].ВариантОтветаHTML, МассивСтрок[0].СтруктураВложений);
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьВариантОтветаHTML()

&НаСервере
// Процедура добавляет новое решение в таблицу связанных решений.
//
// Параметры:
//	Решение	- СправочникСсылка	- Добавляемое решение.
//
Процедура ДобавитьСвязанноеРешение(Решение)
	НоваяСтрока = СвязанныеРешения.Добавить();
	НоваяСтрока.Решение			= Решение;
	НоваяСтрока.Наименование	= Решение.Наименование;
	НоваяСтрока.Состояние		= Решение.СтатусРешения;
КонецПроцедуры // ДобавитьСвязанноеРешение()

&НаСервере
// Процедура отображает категории решения на форме.
//
// Параметры:
//	Нет.
//
Процедура ОтрисоватьКатегорииНаФорме()
	ПрефиксРеквизита = "ПолеВводаКатегория";
	МассивУдаляемыхРеквизитов = Новый Массив();
	нИндекс = 1;
	Пока Истина Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		Попытка
			ТестовыйРеквизит = ЭтотОбъект[ИмяРеквизита];
			МассивУдаляемыхРеквизитов.Добавить(ИмяРеквизита);
			нИндекс = нИндекс + 1;
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	МассивКатегорий = Новый Массив();
	Если ЗначениеЗаполнено(Объект.ОсновнаяКатегория) Тогда
		МассивКатегорий.Добавить(Объект.ОсновнаяКатегория);
	КонецЕсли;
	Для Каждого СтрокаКатегория Из Объект.Категории Цикл
		Если ЗначениеЗаполнено(СтрокаКатегория.Категория) И МассивКатегорий.Найти(СтрокаКатегория.Категория) = Неопределено Тогда
			МассивКатегорий.Добавить(СтрокаКатегория.Категория);
		КонецЕсли;
	КонецЦикла;
	МассивДобавляемыхРеквизитов = Новый Массив();
	нИндекс = 1;
	ОписаниеТиповКатегория = Новый ОписаниеТипов("СправочникСсылка.CRM_КатегорииРешений");
	Для Каждого ДобавляемаяКатегория Из МассивКатегорий Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		РеквизитКатегория = Новый РеквизитФормы(ИмяРеквизита, ОписаниеТиповКатегория);
		МассивДобавляемыхРеквизитов.Добавить(РеквизитКатегория);
		нИндекс = нИндекс + 1;
	КонецЦикла;
	Для Каждого УдаляемыйЭлемент Из МассивУдаляемыхРеквизитов Цикл
		Попытка Элементы.Удалить(Элементы[УдаляемыйЭлемент]);
		Исключение КонецПопытки;
	КонецЦикла;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	нИндекс = 1;
	Для Каждого ДобавляемаяКатегория Из МассивКатегорий Цикл
		ИмяРеквизита = ПрефиксРеквизита + Формат(нИндекс, "ЧДЦ=0; ЧН=0; ЧГ=");
		ЭтотОбъект[ИмяРеквизита] = ДобавляемаяКатегория;
		
		ЦветФона = Новый Цвет(ДобавляемаяКатегория.ЦветКрасный, ДобавляемаяКатегория.ЦветЗеленый, ДобавляемаяКатегория.ЦветСиний);
		ЭлементыЗаголовка = Новый Массив;
		Если нИндекс = 1 Тогда
			ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(" "+ДобавляемаяКатегория.ПредставлениеНаименования+" ", Новый Шрифт(, , Истина), CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФона), ЦветФона));
		Иначе	
			ЭлементыЗаголовка.Добавить(Новый ФорматированнаяСтрока(" "+ДобавляемаяКатегория.ПредставлениеНаименования+" ", , CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(ЦветФона), ЦветФона));
		КонецЕсли;
		ЭлементКатегория = Элементы.Добавить(ИмяРеквизита, Тип("ДекорацияФормы"), Элементы.ГруппаКатегории);
		ЭлементКатегория.Вид = ВидДекорацииФормы.Надпись;
		ЭлементКатегория.Заголовок = Новый ФорматированнаяСтрока(ЭлементыЗаголовка);
		ЭлементКатегория.Подсказка = ДобавляемаяКатегория.ПредставлениеНаименования;
		ЭлементКатегория.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		ЭлементКатегория.АвтоМаксимальнаяШирина = Ложь;
		ЭлементКатегория.РастягиватьПоГоризонтали = Ложь;
		
		нИндекс = нИндекс + 1;
	КонецЦикла;
КонецПроцедуры // ОтрисоватьКатегорииНаФорме()

&НаСервереБезКонтекста
// Функция получает все вложения решения.
//
// Параметры:
//	Ссылка		- СправочникСсылка	- Владелец вложений.
//	НомерСтроки	- Число				- НомерСтроки
//  КлючСтроки  - Строка (по умолчанию нет)	- Ключ строки, для которой нужно получить вложения.
//
// Возвращаемое значение:
//	ТаблицаЗначений	- Таблица вложений.
//
Функция ПолучитьВложения(Ссылка, ИДФайлаЭлектронногоПисьма = "")
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("ИДФайлаЭлектронногоПисьма",	ИДФайлаЭлектронногоПисьма);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Ссылка,
	|	Файлы.ИндексКартинки,
	|	Файлы.Размер,
	|	Файлы.ИДФайлаЭлектронногоПисьма,
	|	ВЫБОР
	|		КОГДА Файлы.Расширение = """"
	|			ТОГДА Файлы.Наименование
	|		ИНАЧЕ Файлы.Наименование + ""."" + Файлы.Расширение
	|	КОНЕЦ КАК ИмяФайла
	|ИЗ
	|	Справочник.CRM_РешенияПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &Ссылка
	|	И НЕ Файлы.ПометкаУдаления
	|	И Файлы.ИДФайлаЭлектронногоПисьма = &ИДФайлаЭлектронногоПисьма";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьВложения()

&НаКлиенте
// Процедура заполняет надпись представление вложений.
//
// Параметры:
//	Нет.
//
Процедура СформироватьПредставлениеСвязанныхРешений()
	
	Если СвязанныеРешения.Количество() = 0 Тогда
		ПредставлениеСвязанныхРешений = НСтр("ru='Связанные решения'");
	Иначе
		ПредставлениеСвязанныхРешений = НСтр("ru='Связанные решения'") + 
		" (" + Строка(СвязанныеРешения.Количество()) + ")";
	КонецЕсли;
	
	Элементы.ГруппаСвязанныеРешенияСворачиваемая.Заголовок = ПредставлениеСвязанныхРешений;
	
КонецПроцедуры // СформироватьПредставлениеВложений()	

&НаКлиенте
// Процедура - обработчик события "ПриАктивизацииСтроки" табличной части "Ответы".
//
// Параметры:
//	Нет.
//
Процедура ОбработчикОтветыПриАктивизацииСтроки()
	
	ТД = Элементы.Ответы.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	ИначеЕсли ПустаяСтрока(ТД.ИДСтроки) Тогда
		ТД.ИДСтроки = СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_");
	КонецЕсли;
	
	ТекущийИДОтвета = ТД.ИДСтроки;
	
	// Заполняем текущий ответ
	ЗаполнитьВариантОтветаHTML();
	// Устанавливаем доступность ответа.
	УстановитьДоступностьОтвета();
	
	УправлениеОтметкойНаличияФайловОтветы(ТекущийИДОтвета);
	
КонецПроцедуры // ОбработчикОтветыПриАктивизацииСтроки()

&НаКлиенте
// Процедура устанавливает видимость колонки "Состояние" табличной части "Ответы".
//
// Параметры:
//	Нет.
//
Процедура ВидимостьСостоянияОтветов();
	Элементы.ОтветыСтатусОтвета.Видимость = Не (Объект.СтатусРешения = ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Личное"));
КонецПроцедуры // ВидимостьСостоянияОтветов()

&НаСервере
// Процедура управляет доступностью решения.
//
// Параметры:
//	Нет.
//
Процедура УстановитьДоступностьРешения()
	
	РешениеДоступно = Истина;
	
	Если Не CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		Если Объект.СтатусРешения = Перечисления.CRM_СтатусыРешений.Утверждено Тогда
			РешениеДоступно = Ложь;
		ИначеЕсли Объект.СтатусРешения = Перечисления.CRM_СтатусыРешений.Устарело Тогда
			РешениеДоступно = Ложь;
		ИначеЕсли Не (Объект.Автор = ТекущийПользователь()) Тогда
			РешениеДоступно = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Наименование.ТолькоПросмотр		   = Не РешениеДоступно;
	Элементы.Подразделение.ТолькоПросмотр		   = Не РешениеДоступно;
	Элементы.Проект.ТолькоПросмотр				   = Не РешениеДоступно;
	Элементы.Родитель.ТолькоПросмотр			   = Не РешениеДоступно;
	Элементы.СтатусРешения.ТолькоПросмотр		   = Не РешениеДоступно;
	Элементы.ДекорацияВыбратьКатегории.Доступность = РешениеДоступно;
	
	Элементы.ГруппаРедактированиеВопроса.Видимость = РешениеДоступно;
	Элементы.ПолеПросмотраВопросаHTML.Видимость = Не РешениеДоступно;
	Если Не РешениеДоступно Тогда
		ТекстВопроса = ОбработатьТекстHTML(Объект.Ссылка, Объект.Ссылка.ТекстВопросаHTML, УникальныйИдентификатор);
		Элементы.СвязанныеРешения.ИзменятьСоставСтрок = Ложь;
		Элементы.СвязанныеРешения.ИзменятьПорядокСтрок = Ложь;
		Элементы.СвязанныеРешения.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	КонецЕсли;
	
	Если Объект.СтатусРешения = Перечисления.CRM_СтатусыРешений.Личное И Не (Объект.Автор = ТекущийПользователь()) Тогда
		Элементы.Ответы.ИзменятьСоставСтрок  = Ложь;
		Элементы.Ответы.ИзменятьПорядокСтрок = Ложь;
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьРешения()

&НаКлиенте
// Процедура управляет доступностью ответа.
//
// Параметры:
//	Нет.
//
Процедура УстановитьДоступностьОтвета()
	
	ОтветДоступен = Истина;
	
	ТД = Элементы.Ответы.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	
	Если Не CRM_БазаЗнанийСервер.ЕстьПраваАдминистратора() Тогда
		
		Если ТД.СтатусОтвета = ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Утверждено") Тогда
			ОтветДоступен = Ложь;
			
		ИначеЕсли ТД.СтатусОтвета = ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Устарело") Тогда
			ОтветДоступен = Ложь;
		
		ИначеЕсли Объект.СтатусРешения = ПредопределенноеЗначение("Перечисление.CRM_СтатусыРешений.Личное") И Не (Объект.Автор = ТекущийПользователь()) Тогда
			ОтветДоступен = Ложь;
			
		ИначеЕсли Не (ТД.АвторИзменения = ТекущийПользователь()) Тогда
			ОтветДоступен = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ОтветыВариантОтвета.ТолькоПросмотр = Не ОтветДоступен;
	Элементы.ОтветыСтатусОтвета.ТолькоПросмотр  = Не ОтветДоступен;
	
	Элементы.ГруппаВариантОтветаHTML.Видимость = ОтветДоступен;
	Элементы.ПолеПросмотраОтветаHTML.Видимость = Не ОтветДоступен;
	
	Если Не ОтветДоступен Тогда
		ТекстОтвета = ОбработатьТекстHTML(Объект.Ссылка, ТД.ВариантОтветаHTML, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьОтвета()

&НаКлиенте
// Процедура управляет доступностью таблицы ответов и связанных решений.
//
// Параметры:
//	Нет.
//
Процедура УстановитьДоступностьОтветов()
	
	РешениеЗаписано = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ДекорацияОтветыНедоступны.Видимость	= Не РешениеЗаписано;
	Элементы.Ответы.ТолькоПросмотр					= Не РешениеЗаписано;
	Элементы.ВариантОтветаHTML.ТолькоПросмотр		= Не РешениеЗаписано;
	Элементы.СвязанныеРешения.ТолькоПросмотр		= Не РешениеЗаписано;
	Элементы.ВариантОтветаHTMLПроверкаПравописанияОтвета.Доступность = РешениеЗаписано;
	
КонецПроцедуры // УстановитьДоступностьОтветов()

&НаСервере
Процедура ОбработатьТекстВопроса()
	
	СтруктураВложений = Новый Структура;
	Объект.ТекстВопросаHTML = Справочники.CRM_Решения.ОбработатьТекстHTMLДляФорматированногоДокумента(
	Объект.Ссылка, Объект.ТекстВопросаHTML,СтруктураВложений);
	
	ТекстВопросаHTML.УстановитьHTML(Объект.ТекстВопросаHTML, СтруктураВложений);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьТекстыОтветов()
	
	Для Каждого СтрокаОтвета Из Объект.Ответы Цикл
		
		СтрокаСоответствия = ТаблицаСоответствийОтветов.Добавить();
		СтрокаСоответствия.ИДСтроки = СтрокаОтвета.ИДСтроки;
		
		СтрокаСоответствия.СтруктураВложений = Новый Структура;
		СтрокаСоответствия.ВариантОтветаHTML = Справочники.CRM_Решения.ОбработатьТекстHTMLДляФорматированногоДокумента(
		Объект.Ссылка, СтрокаОтвета.ВариантОтветаHTML,СтрокаСоответствия.СтруктураВложений);
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииИПриЧтенииНаСервере()
	
	ОбработатьТекстВопроса();
	ОбработатьТекстыОтветов();
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриСозданииИПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Функция ДобавитьВТаблицуСоответствийИменВложенийИдентификаторамКартинкиИзИнтернета(ПереданныйТекстHTML)
	
	ДокументHTML = Взаимодействия.ПолучитьОбъектДокументHTMLИзТекстаHTML(ПереданныйТекстHTML);
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		Если АтрибутИсточникКартинки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрЧислоВхождений(АтрибутИсточникКартинки.ТекстовоеСодержимое, "://") > 0 Тогда
			РезультатСкаченногоФайла = ПолучениеФайловИзИнтернета.СкачатьФайлВоВременноеХранилище(АтрибутИсточникКартинки.ТекстовоеСодержимое);
			
			Если Не РезультатСкаченногоФайла = Неопределено И РезультатСкаченногоФайла.Статус Тогда
				НоваяКартинка = Новый Картинка(ПолучитьИзВременногоХранилища(РезультатСкаченногоФайла.Путь));
				
				НоваяСтрока = ТаблицаСоответствийИменВложенийИдентификаторам.Добавить();
				НоваяСтрока.ИмяФайла = АтрибутИсточникКартинки.ТекстовоеСодержимое;
				НоваяСтрока.ИдентификаторФайлаДляHTML = Новый УникальныйИдентификатор;
				НоваяСтрока.Картинка = НоваяКартинка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьЧислоВложений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(CRM_РешенияПрисоединенныеФайлы.Ссылка) КАК КоличествоФайлов
	|ИЗ
	|	Справочник.CRM_РешенияПрисоединенныеФайлы КАК CRM_РешенияПрисоединенныеФайлы
	|ГДЕ
	|	CRM_РешенияПрисоединенныеФайлы.ВладелецФайла = &Ссылка
	|	И НЕ CRM_РешенияПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.КоличествоФайлов;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбработатьТекстHTML(Вопрос, ТекстHTML, ИдентификаторФормы)
	
	Кодировка = "utf-8";
	
	Если Не ПустаяСтрока(ТекстHTML) Тогда
		Если СтрЧислоВхождений(ТекстHTML,"<head") = 0 Тогда
			ТекстHTML = "
			|<html>
			|<head>  
			|<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
			|<META content=""MSHTML 6.00.2800.1400"" name=GENERATOR>
			|<body scroll=""auto"">" + ТекстHTML + "
			|</body>
			|</html>";
		КонецЕсли;
		
		ТаблицаФайлов = Взаимодействия.ПолучитьВложенияПисьмаСНеПустымИД(Вопрос);
		Если ТаблицаФайлов.Количество() Тогда
			
			ДокументHTML = CRM_БазаЗнанийСервер.ЗаменитьИдентификаторыКартинокНаПутьКФайлам(ТекстHTML, ТаблицаФайлов, Кодировка,,ИдентификаторФормы);
			
			Возврат Взаимодействия.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			
		Иначе
			Возврат ТекстHTML;
		КонецЕсли;
		
	Иначе
		Возврат ТекстHTML;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПрисоединенныеФайлы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда Возврат КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Не РешениеДоступно);
	ПараметрыФормы.Вставить("CRM_НеЗапрашиватьКонтекст", Истина);
	
	ФормаПрисоединенныхФайлов = ПолучитьФорму("Обработка.РаботаСФайлами.Форма.CRM_ПрисоединенныеФайлы", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор);
	
	Если ФормаПрисоединенныхФайлов.Открыта() Тогда
				
		ФормаПрисоединенныхФайлов.Активизировать();
	Иначе
		ФормаПрисоединенныхФайлов.ЗакрыватьПриЗакрытииВладельца = Истина;
		
		ФормаПрисоединенныхФайлов.Открыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
